Tekla.Structures.Drawing.BaseLinePlacing
The BaseLinePlacing class defines a placing where the
object is placed using a line as a reference.
This will thus define the object's X-axis along that line.

Tekla.Structures.Drawing.BaseLinePlacing.StartPoint
Sets the start point of the line that the object is using for the placement.

Tekla.Structures.Drawing.BaseLinePlacing.EndPoint
Sets the end point of the line that the object is using for the placement.

Tekla.Structures.Drawing.BaseLinePlacing.#ctor
Construct object

Tekla.Structures.Drawing.BaseLinePlacing.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new base line placing instance.
The given two points define the line to be used for the placing.
StartPoint: The first point of the line.
EndPoint: The second point of the line.

Tekla.Structures.Drawing.BaseLinePlacing.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.